app/Controllers/Admin.php

SELECT *
FROM `reviews`
WHERE `status` = 'Pending'
SELECT *
FROM `booking`
WHERE `status` = 'Pending'
---
    public function orderlist()
    {
        $data = [];

        if (!session()->get('isLoggedIn') || (!session()->get('isAdmin') && !session()->get('isSuperAdmin'))) {
            return redirect()->to('/'); // Redirect to landing page if not logged in as admin or superadmin
        }
        $user_info = [
            'firstname' => session()->get('firstname'),
        ];


        $Order_model = new Order_model();
        $Review_model = new Review_model();
        $Booking_model = new Booking_model();

        $toshipOrders = $Order_model
        ->where('order_status', 'To Pay')->findAll();

        $onthewayOrders = $Order_model
        ->where('order_status', 'To Deliver')->findAll();

        $orders = $Order_model
        ->select("DATE_FORMAT(order_date, '%M %e, %Y') AS order_date_formatted, orderdata.*")
        // ->whereIn('order_type', ['COD', 'Online','Pick Up','Pick Up (Paid)', 'N/A', 'Request', 'Settle', 'Agree'])
        ->findAll();

        $newOrders = $Order_model->whereIn('order_status', ['Pending', 'Settle', 'Request', 'Agree'])->findAll();
        $newcomment = $Review_model->where('status', 'Pending')->findAll();
        $newBooking = $Booking_model->where('status', 'Pending')->findAll();