app/Controllers/Orders.php

DELETE FROM `order_item`
WHERE `fk_order_id` = '359'
---
    public function ordersdelete($id)
    {
        $Order_model = new Order_model();
        $Order_Item_model = new Order_Item_model();

        $Order_model->delete($id);

        $Order_Item_model->where('fk_order_id', $id)->delete();

SELECT *
FROM `reviews`
WHERE `status` = 'Pending'
SELECT *
FROM `booking`
WHERE `status` = 'Pending'
---
    public function topay_orders(){
        $data = [];
        if (!session()->get('isLoggedIn') || (!session()->get('isAdmin') && !session()->get('isSuperAdmin'))) {
            return redirect()->to('/'); // Redirect to landing page if not logged in as admin or superadmin
        }

        $Order_model = new Order_model();
        $Review_model = new Review_model();
        $Booking_model = new Booking_model();

        $toshipOrders = $Order_model
        ->where('order_status', 'To Pay')->findAll();

        $onthewayOrders = $Order_model
        ->where('order_status', 'To Deliver')->findAll();

        $user_info = [
            'firstname' => session()->get('firstname'),
            'lastname' => session()->get('lastname'),
            'email' => session()->get('email'),
            'phone' => session()->get('phone'),
            'address' => session()->get('address'),
            'password' => session()->get('password'),
        ];

        $orders = $Order_model->where('order_status', 'To Pay')
        ->select("DATE_FORMAT(order_date, '%M %e, %Y') AS order_date_formatted, orderdata.*")
        ->findAll();

        $newOrders = $Order_model->whereIn('order_status', ['Pending', 'Settle', 'Request', 'Agree'])->findAll();
        $newcomment = $Review_model->where('status', 'Pending')->findAll();
        $newBooking = $Booking_model->where('status', 'Pending')->findAll();